## Pandas 2

In [2]:
import numpy as np
import pandas as pd

In [3]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
df2 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])

In [4]:
print(df1)

  letter  number
0      a       1
1      b       2

In [5]:
print(df2)

  letter  number animal
0      c       3    cat
1      d       4    dog

In [6]:
pd.concat([df1,df2])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [8]:
print(pd.concat([df1,df2], axis=1))

  letter  number letter  number animal
0      a       1      c       3    cat
1      b       2      d       4    dog

In [10]:
df_x = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
df_y = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
print(df_x.append(df_y))

AttributeError: 'DataFrame' object has no attribute 'append'

In [12]:
url1 = 'https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv'
url2 = 'https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv'
url3 = 'https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv'

pop = pd.read_csv(url1)
areas = pd.read_csv(url2)
abbrevs = pd.read_csv(url3)

In [13]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [14]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [15]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [24]:
df3 = pd.merge(abbrevs,pop,
         left_on='abbreviation',
         right_on="state/region").drop(columns=['abbreviation','state/region'])
df3

        state     ages  year  population
0     Alabama  under18  2012   1117489.0
1     Alabama    total  2012   4817528.0
2     Alabama  under18  2010   1130966.0
3     Alabama    total  2010   4785570.0
4     Alabama  under18  2011   1125763.0
...       ...      ...   ...         ...
2443  Wyoming  under18  1993    137458.0
2444  Wyoming    total  1991    459260.0
2445  Wyoming  under18  1991    136720.0
2446  Wyoming  under18  1990    136078.0
2447  Wyoming    total  1990    453690.0

[2448 rows x 4 columns]

In [26]:
df = pd.merge(df3,areas)
df.isnull().sum()

state            0
ages             0
year             0
population       0
area (sq. mi)    0
dtype: int64

In [27]:
df

        state     ages  year  population  area (sq. mi)
0     Alabama  under18  2012   1117489.0          52423
1     Alabama    total  2012   4817528.0          52423
2     Alabama  under18  2010   1130966.0          52423
3     Alabama    total  2010   4785570.0          52423
4     Alabama  under18  2011   1125763.0          52423
...       ...      ...   ...         ...            ...
2443  Wyoming  under18  1993    137458.0          97818
2444  Wyoming    total  1991    459260.0          97818
2445  Wyoming  under18  1991    136720.0          97818
2446  Wyoming  under18  1990    136078.0          97818
2447  Wyoming    total  1990    453690.0          97818

[2448 rows x 5 columns]

In [28]:
df_total = df[df.ages =='total']
df_total

        state   ages  year  population  area (sq. mi)
1     Alabama  total  2012   4817528.0          52423
3     Alabama  total  2010   4785570.0          52423
5     Alabama  total  2011   4801627.0          52423
6     Alabama  total  2009   4757938.0          52423
9     Alabama  total  2013   4833722.0          52423
...       ...    ...   ...         ...            ...
2439  Wyoming  total  1994    480283.0          97818
2441  Wyoming  total  1992    466251.0          97818
2442  Wyoming  total  1993    473081.0          97818
2444  Wyoming  total  1991    459260.0          97818
2447  Wyoming  total  1990    453690.0          97818

[1224 rows x 5 columns]

In [29]:
df_total['density'] = df_total['population']/df_total['area (sq. mi)']

C:\Users\Admin\AppData\Local\Temp\ipykernel_19040\1912815963.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_total['density'] = df_total['population']/df_total['area (sq. mi)']

In [30]:
df_total

        state   ages  year  population  area (sq. mi)    density
1     Alabama  total  2012   4817528.0          52423  91.897221
3     Alabama  total  2010   4785570.0          52423  91.287603
5     Alabama  total  2011   4801627.0          52423  91.593900
6     Alabama  total  2009   4757938.0          52423  90.760506
9     Alabama  total  2013   4833722.0          52423  92.206131
...       ...    ...   ...         ...            ...        ...
2439  Wyoming  total  1994    480283.0          97818   4.909965
2441  Wyoming  total  1992    466251.0          97818   4.766515
2442  Wyoming  total  1993    473081.0          97818   4.836339
2444  Wyoming  total  1991    459260.0          97818   4.695046
2447  Wyoming  total  1990    453690.0          97818   4.638103

[1224 rows x 6 columns]

In [35]:
df_total[df_total['year']==2010].sort_values(by='density',
                     ascending=False, 
                     inplace=False)

,state,ages,year,population,area (sq. mi),density
389,District of Columbia,total,2010,605125.0,68,8898.897059
1157,New Jersey,total,2010,8802707.0,8722,1009.253268
1914,Rhode Island,total,2010,1052669.0,1545,681.339159
293,Connecticut,total,2010,3579210.0,5544,645.600649
1626,Massachusetts,total,2010,6563263.0,10555,621.815538
1541,Maryland,total,2010,5787193.0,12407,466.445797
379,Delaware,total,2010,899711.0,1954,460.445752
1253,New York,total,2010,19398228.0,54475,356.094135
475,Florida,total,2010,18846054.0,65758,286.597129
1829,Pennsylvania,total,2010,12710472.0,46058,275.966651
1434,Ohio,total,2010,11545435.0,44828,257.549634
197,California,total,2010,37333601.0,163707,228.051342
666,Illinois,total,2010,12839695.0,57918,221.687472
2213,Virginia,total,2010,8024417.0,42769,187.622273
677,Indiana,total,2010,6489965.0,36420,178.197831
1338,North Carolina,total,2010,9559533.0,53821,177.617157
485,Georgia,total,2010,9713248.0,59441,163.409902
2021,Tennessee,total,2010,6356683.0,42146,150.825298
1925,South Carolina,total,2010,4636361.0,32007,144.854594
1146,New Hampshire,total,2010,1316614.0,9351,140.799273
570,Hawaii,total,2010,1363731.0,10932,124.746707
858,Kentucky,total,2010,4347698.0,40411,107.586994
1637,Michigan,total,2010,9876149.0,96810,102.015794
2298,Washington,total,2010,6742256.0,71303,94.557817
2106,Texas,total,2010,25245178.0,268601,93.987655
3,Alabama,total,2010,4785570.0,52423,91.287603
869,Louisiana,total,2010,4545392.0,51843,87.676099
2394,Wisconsin,total,2010,5689060.0,65503,86.851900
1818,Missouri,total,2010,5996063.0,69709,86.015622
2309,West Virginia,total,2010,1854146.0,24231,76.519582
2202,Vermont,total,2010,625793.0,9615,65.085075
1733,Mississippi,total,2010,2970047.0,48434,61.321530
1722,Minnesota,total,2010,5310337.0,86943,61.078373
101,Arizona,total,2010,6408790.0,114006,56.214497
189,Arkansas,total,2010,2922280.0,53182,54.948667
762,Iowa,total,2010,3050314.0,56276,54.202751
1445,Oklahoma,total,2010,3759263.0,69903,53.778278
283,Colorado,total,2010,5048196.0,104100,48.493718
1530,Oregon,total,2010,3837208.0,98386,39.001565
954,Maine,total,2010,1327366.0,35387,37.509990
773,Kansas,total,2010,2858910.0,82282,34.745266
2117,Utah,total,2010,2774424.0,84904,32.677188
1061,Nevada,total,2010,2703230.0,110567,24.448796
1050,Nebraska,total,2010,1829838.0,77358,23.654153
581,Idaho,total,2010,1570718.0,83574,18.794338
1242,New Mexico,total,2010,2064982.0,121593,16.982737
2010,South Dakota,total,2010,816211.0,77121,10.583512
1349,North Dakota,total,2010,674344.0,70704,9.537565
965,Montana,total,2010,990527.0,147046,6.736171
2405,Wyoming,total,2010,564222.0,97818,5.768079
91,Alaska,total,2010,713868.0,656425,1.087509

In [36]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [40]:
planets.number.sum()

np.int64(1848)

In [43]:
planets[planets.number>1].number.count()

np.int64(440)

In [42]:
planets.shape

(1035, 6)

In [45]:
planets.isnull().sum()

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

In [46]:
planets.orbital_period.mean()

np.float64(2002.9175960947582)

In [50]:
planets.method.unique().shape

(10,)

In [54]:
dict_1 = {'Method':[], 'Number':[]}
for method in planets.method.unique():
    dict_1["Method"].append(method)
    s = planets[planets.method ==  method].number.sum()
    dict_1['Number'].append(s)
pd.DataFrame(dict_1)

                          Method  Number
0                Radial Velocity     952
1                        Imaging      50
2      Eclipse Timing Variations      15
3                        Transit     776
4                     Astrometry       2
5      Transit Timing Variations       9
6  Orbital Brightness Modulation       5
7                   Microlensing      27
8                  Pulsar Timing      11
9    Pulsation Timing Variations       1

In [56]:
planets.year.unique()

array([2006, 2008, 2011, 2007, 2009, 2002, 1996, 2010, 2001, 1995, 2004,
       2012, 2013, 2005, 2000, 2003, 1997, 1999, 2014, 1998, 1989, 1992,
       1994])

In [58]:
planets[['method','number']].groupby('method').sum()

                               number
method
Astrometry                          2
Eclipse Timing Variations          15
Imaging                            50
Microlensing                       27
Orbital Brightness Modulation       5
Pulsar Timing                      11
Pulsation Timing Variations         1
Radial Velocity                   952
Transit                           776
Transit Timing Variations           9

In [59]:
planets[['method','number']].groupby('method').mean()

                                 number
method
Astrometry                     1.000000
Eclipse Timing Variations      1.666667
Imaging                        1.315789
Microlensing                   1.173913
Orbital Brightness Modulation  1.666667
Pulsar Timing                  2.200000
Pulsation Timing Variations    1.000000
Radial Velocity                1.721519
Transit                        1.954660
Transit Timing Variations      2.250000

In [60]:
planets[['method','number']].groupby('method').count()

                               number
method
Astrometry                          2
Eclipse Timing Variations           9
Imaging                            38
Microlensing                       23
Orbital Brightness Modulation       3
Pulsar Timing                       5
Pulsation Timing Variations         1
Radial Velocity                   553
Transit                           397
Transit Timing Variations           4

In [61]:
df = pd.DataFrame({'key': list("ABCABC"),
                   "data1":range(6),
                   'data2':range(6,12)},
                   columns=['key','data1','data2'])
df

  key  data1  data2
0   A      0      6
1   B      1      7
2   C      2      8
3   A      3      9
4   B      4     10
5   C      5     11

In [62]:
myfunc = lambda x: x.sum()//2

In [64]:
myfunc(np.array([1,2,3]))

np.int64(3)

In [67]:
df[['key','data1']].groupby('key').aggregate(['sum','min',myfunc])

    data1
      sum min <lambda_0>
key
A       3   0          1
B       5   1          2
C       7   2          3

In [68]:
df[['key','data1']]

  key  data1
0   A      0
1   B      1
2   C      2
3   A      3
4   B      4
5   C      5